stm32duino/Arduino_Core_STM32/libraries/SrcWrapper/inc/LL/stm32yyxx_ll_iwdg.h
#ifndef _STM32YYXX_LL_IWDG_H_
#define _STM32YYXX_LL_IWDG_H_
/* LL raised several warnings, ignore them */
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#pragma GCC diagnostic ignored "-Wstrict-aliasing"
#ifdef __cplusplus
  #pragma GCC diagnostic ignored "-Wregister"
#endif

#ifdef STM32C0xx
  #include "stm32c0xx_ll_iwdg.h"
#elif STM32C5xx
  #include "stm32c5xx_ll_iwdg.h"
#elif STM32F0xx
  #include "stm32f0xx_ll_iwdg.h"
#elif STM32F1xx
  #include "stm32f1xx_ll_iwdg.h"
#elif STM32F2xx
  #include "stm32f2xx_ll_iwdg.h"
#elif STM32F3xx
  #include "stm32f3xx_ll_iwdg.h"
#elif STM32F4xx
  #include "stm32f4xx_ll_iwdg.h"
#elif STM32F7xx
  #include "stm32f7xx_ll_iwdg.h"
#elif STM32G0xx
  #include "stm32g0xx_ll_iwdg.h"
#elif STM32G4xx
  #include "stm32g4xx_ll_iwdg.h"
#elif STM32H5xx
  #include "stm32h5xx_ll_iwdg.h"
#elif STM32H7xx
  #include "stm32h7xx_ll_iwdg.h"
#elif STM32H7RSxx
  #include "stm32h7rsxx_ll_iwdg.h"
#elif STM32L0xx
  #include "stm32l0xx_ll_iwdg.h"
#elif STM32L1xx
  #include "stm32l1xx_ll_iwdg.h"
#elif STM32L4xx
  #include "stm32l4xx_ll_iwdg.h"
#elif STM32L5xx
  #include "stm32l5xx_ll_iwdg.h"
#elif STM32U0xx
  #include "stm32u0xx_ll_iwdg.h"
#elif STM32U3xx
  #include "stm32u3xx_ll_iwdg.h"
#elif STM32U5xx
  #include "stm32u5xx_ll_iwdg.h"
#elif STM32WBxx
  #include "stm32wbxx_ll_iwdg.h"
#elif STM32WB0x
  #include "stm32wb0x_ll_iwdg.h"
#elif STM32WBAxx
  #include "stm32wbaxx_ll_iwdg.h"
#elif STM32WLxx
  #include "stm32wlxx_ll_iwdg.h"
#elif STM32WL3x
  #include "stm32wl3x_ll_iwdg.h"
#endif
#pragma GCC diagnostic pop
#endif /* _STM32YYXX_LL_IWDG_H_ */
